import numpy as np
import pandas as pd

df = pd.read_csv('client_vec_5.csv', encoding='utf-8')
a = df['曾經持有投資產品-新興市場股票基金、單一新興國家股票基金、衍生性商品'].values == 1
b = df['基金投資目的偏好-新興市場股票基金、單一新興國家股票基金、衍生性商品'].values == 1
c = df['家庭年收入-100 萬元~300 萬元'].values == 1
d = df['家庭年收入-500 萬元以上'].values == 1
e = df['家庭年收入-50 萬元以下'].values == 1
f = df['家庭年收入-300 萬元~500 萬元'].values == 1

ans = (a & (c | f | d)) | (b & (e | f | d))

print('曾經持有投資產品-新興市場股票基金、單一新興國家股票基金、衍生性商品 & 家庭年收入-100 萬元~300 萬元:',df['客戶ID'][a&c].values,sep='\n',end='\n\n')
print('曾經持有投資產品-新興市場股票基金、單一新興國家股票基金、衍生性商品 & 家庭年收入-300 萬元~500 萬元:',df['客戶ID'][a&f].values,sep='\n',end='\n\n')
print('曾經持有投資產品-新興市場股票基金、單一新興國家股票基金、衍生性商品 & 家庭年收入-500 萬元以上:',df['客戶ID'][a&d].values,sep='\n',end='\n\n')
print('基金投資目的偏好-新興市場股票基金、單一新興國家股票基金、衍生性商品 & 家庭年收入-50 萬元以下:', df['客戶ID'][b & e].values,sep='\n',end='\n\n')
print('基金投資目的偏好-新興市場股票基金、單一新興國家股票基金、衍生性商品 & 家庭年收入-300 萬元~500 萬元:',df['客戶ID'][b&f].values,sep='\n',end='\n\n')
print('基金投資目的偏好-新興市場股票基金、單一新興國家股票基金、衍生性商品 & 家庭年收入-500 萬元以上:',df['客戶ID'][b&d].values,sep='\n',end='\n\n')
